<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class PermissionSeeder extends Seeder
{

    public function run(): void
    {
        $permissions = [
           'لوحة-التحكم',
           'تعديل-الاعدادت',

          'قائمة-التصنيفات',
           'اضافة-تصنيف',
           'تعديل-تصنيف',
           'حذف-تصنيف',
           'تغيير-حالة-تصنيف',


           'قائمة-السنوات-المالية',
           'اضافة-سنة-مالية',
           'تعديل-سنة-مالية',
           'حذف-سنة-مالية',
           'تغيير-حالة-سنة-مالية',

           'قائمة-الشهور-المالية',
           'اضافة-شهر-مالي',
           'تعديل-شهر-مالي',
           'حذف-شهر-مالي',

           'قائمة-الاصول-الثابتة',
           'اضافة-اصل-ثابت',
           'تعديل-اصل-ثابت',
           'حذف-اصل-ثابت',

           'قائمة-المنتجات',
           'اضافة-منتج',
           'تعديل-منتج',
           'حذف-منتج',
           'تغيير حالة-منتج',
           'استيراد-منتجات-من-اكسل',

           'قائمة-العروض',
           'اضافة-عرض',
           'تعديل-عرض',
           'حذف-عرض',


           'قائمة-منتجات-العمولة',
           'اضافة-عمولة-منتج',
           'تعديل-عمولة-منتج',
           'حذف-عمولة-منتج',

           'قائمة-السلف',
           'اضافة-سلفة',
           'تعديل-سلفة',
           'حذف-سلفة',

           'قائمة-الخصومات',
           'اضافة-خصم',
           'تعديل-خصم',
           'حذف-خصم',

            'قائمة-المكافئات',
           'اضافة-مكافأة',
           'تعديل-مكافأة',
           'حذف-مكافأة',


           'قائمة-النواقص',
           'اضافة-نواقص',
           'تعديل-نواقص',
           'حذف-نواقص',
           'طباعة-نواقص',


            'قائمة-الوحدات',
           'اضافة-وحدة',
           'تعديل-وحدة',
           'حذف-وحدة',
           'تغيير حالة-وحدة',

         'قائمة-المهام',
           'اضافة-مهمة',
           'تعديل-مهمة',
           'حذف-مهمة',


            'قائمة-الموظفين',
           'اضافة-موظف',
           'تعديل-موظف',
           'حذف-موظف',
           'تغيير حالة-موظف',

           'قائمة-ورديات-الموظفين',
           'اضافة-وردية-موظف',
           'تعديل-وردية-موظف',
           'حذف-وردية-موظف',
           'تغيير-حالة-وردية-موظف',

           'قائمة-الفروع',
           'اضافة-فرع',
           'تعديل-فرع',
           'حذف-فرع',
           'تغيير-حالة-فرع',


           'المبيعات',

           'قائمة-العملاء',
           'اضافة-عميل',
           'تعديل-عميل',
           'حذف-عميل',

           'قائمة-فواتير-العملاء',
           'اضافة-فاتورة-عميل',
           'تعديل-فاتورة-عميل',
           'حذف-فاتورة-عميل',
           'تفاصيل-فاتورة-عميل',
           'طباعة-فاتورة-عميل',

           'قائمة-مردودات-العملاء',
           'اضافة-مردودات-فاتورة-عميل',
           'تعديل-مردودات-فاتورة-عميل',
           'حذف-مردودات-فاتورة-عميل',

           'المشتريات',

           'قائمة-الموردين',
           'اضافة-مورد',
           'تعديل-مورد',
           'حذف-مورد',

           'قائمة-فواتير-الموردين',
           'اضافة-فاتورة-مورد',
           'تعديل-فاتورة-مورد',
           'حذف-فاتورة-مورد',
           'تفاصيل-فاتورة-مورد',
           'طباعة-فاتورة-مورد',

            'قائمة-مردودات-الموردين',
           'اضافة-مردودات-فاتورة-مورد',
           'تعديل-مردودات-فاتورة-مورد',
           'حذف-مردودات-فاتورة-مورد',

            'قائمة-الرواتب',
            'اضافة-راتب',
            'تعديل-راتب',
            'حذف-راتب',

            'قائمة-انواع-الورديات',
            'اضافة-نوع-وردية',
            'تعديل-نوع-وردية',
            'حذف-نوع-وردية',





           'قائمة-ورديات-الخزينة',
           'اضافة-وردية-خزينة',
           'تعديل-وردية-خزينة',
           'حذف-وردية-خزينة',
           'تغيير-حالة-وردية-خزينة',
           'عجز-فائض-وردية-خزينة',

           'قائمة-الخزن',
           'اضافة-خزينة',
           'تعديل-خزينة',
           'حذف-خزينة',
           'تغيير-حالة-خزينة',
           'عجز-فائض-خزينة',


          'قائمة-حركات-الخزن',
           'اضافة-حركة-خزينة',
           'تعديل-حركة-خزينة',
           'حذف-حركة-خزينة',

           'قائمة-البنوك',
           'اضافة-بنك',
           'تعديل-بنك',
           'حذف-بنك',
           'تغيير-حالة-بنك',
           'عجز-فائض-بنك',

        //    'قائمة-حركات-البنوك',
        //    'اضافة-حركة-بنك',
        //    'تعديل-حركة-بنك',
        //    'حذف-حركة-بنك',



           'الحسابات',

           'قائمة-الحركات-البنكية',
            'اضافة-حركة-بنكية',
            'تعديل-حركة-بنكية',
             'حذف-حركة-بنكية',
             'اضافة-ايصال-صرف',
             'اضافة-ايصال-قبض',
             'تعديل-ايصال-صرف',
             'تعديل-ايصال-قبض',
             'حذف-ايصال-صرف',
             'حذف-ايصال-قبض',


          'قائمة-الحسابات-المالية',
           'اضافة-حساب-مالي',
           'تعديل-حساب-مالي',
           'حذف-حساب-مالي',
           'تغيير-حالة-حساب-مالي',
           'تفاصيل-حساب-مالي',

           'قائمة-قيود-اليومية',
           'اضافة-قيد-يومية',
           'تعديل-قيد-يومية',
           'حذف-قيد-يومية',



           'ترحيل-الشبكة-الي-البنك',
           'ترحيل-الكاش-الي-خزينة-الفرع',
           'استلام-الكاش-من-الفرع-وتحويلة-للخزينة-الرئيسية',

           'قائمة-المخازن',
           'اضافة-مخزن',
           'تعديل-مخزن',
           'حذف-مخزن',
           'تغيير-حالة-مخزن',

           'قائمة-الشركاء',
           'اضافة-شريك',
           'تعديل-شريك',
           'حذف-شريك',

          'قائمة-رأس-المال',
           'اضافة-راس-مال',
           'تعديل-راس-مال',
           'حذف-راس-مال',


          'قائمة-جرد-المخزون',
           'اضافة-جرد-مخزون',
           'تعديل-جرد-مخزون',
           'حذف-جرد-مخزون',

          'قائمة-تسوية-المخزون',
           'اضافة-تسوية-مخزون',
           'تعديل-تسوية-مخزون',
           'حذف-تسوية-مخزون',

            'قائمة-تسويات-الخزينة',
            'اضافة-تسوية-خزينة',
            'تعديل-تسوية-خزينة',
            'حذف-تسوية-خزينة',

            'قائمة-تسويات-البنوك',
            'اضافة-تسوية-بنك',
            'تعديل-تسوية-بنك',
            'حذف-تسوية-بنك',

            'قائمة-تسويات-العملاء',
            'اضافة-تسوية-العملاء',
            'تعديل-تسوية-العملاء',
            'حذف-تسوية-العملاء',

            'قائمةالتسويات-الجردية',
            'اضافة-تسوية-جردية',
            'تعديل-تسوية-جردية',
            'حذف-تسوية-جردية',

            'قائمة-تسويات-الايرادات -المصروفات',
            'اضافة-تسوية-ايرادات-مصروفات',
            'تعديل-تسوية-ايرادات-مصروفات',
            'حذف-تسوية-ايرادات-مصروفات',


          'قائمة-تحويلات-المخازن',
           'اضافة-تحويل-مخزن',
           'تعديل-تحويل-مخزن',
           'حذف-تحويل-مخزن',
           'قبول-تحويل-مخزن',

            'قائمة-مراكز-التكلفة',
           'اضافة-مركز-تكلفة',
           'تعديل-مركز-تكلفة',
           'حذف-مركز-تكلفة',
           'تغيير-حالة-مركز-تكلفة',

           'قوائم-المركز-المالي',
           'اضافة-مركز-مالي',
            'حذف-مركز-مالي',
             'تعديل-مركز-مالي',



         //   'اضافة-تقرير',
         //   'تعديل-تقرير',
         //   'حذف-تقرير',
         //   'طباعة-تقرير',
        //    'تصدير-تقرير-excel',
        //    'تصدير-تقرير-pdf',

      //      'قائمة-تقارير-النواقص',
      //      'اضافة-تقرير-نواقص',
      //      'تعديل-تقرير-نواقص',
      //      'حذف-تقرير-نواقص',
      //      'طباعة-تقرير-نواقص',
      //   //    'تصدير-تقرير-نواقص-excel',
      //   //    'تصدير-تقرير-نواقص-pdf',

      //     'قائمة-تقارير-المبيعات',
      //      'اضافة-تقرير-مبيعات',
      //      'تعديل-تقرير-مبيعات',
      //      'حذف-تقرير-مبيعات',
      //      'طباعة-تقرير-مبيعات',
      //   //    'تصدير-تقرير-مبيعات-excel',
      //   //    'تصدير-تقرير-مبيعات-pdf',

      //      'قائمة-تقارير-حركات-الخزن',
      //      'اضافة-تقرير-حركة-خزنة',
      //      'تعديل-تقرير-حركة-خزنة',
      //      'حذف-تقرير-حركة-خزنة',
      //      'طباعة-تقرير-حركة-خزنة',
      //   //    'تصدير-تقرير-حركة-خزنة-excel',
      //   //    'تصدير-تقرير-حركة-خزنة-pdf',

      //      'قائمة-تقارير-البنوك',
      //      'اضافة-تقرير-حركة-بنك',
      //      'تعديل-تقرير-حركة-بنك',
      //      'حذف-تقرير-حركة-بنك',
      //      'طباعة-تقرير-حركة-بنك',
        //    'تصدير-تقرير-حركة-بنك-excel',
        //    'تصدير-تقرير-حركة-بنك-pdf',

           'قائمة-التقارير-المحاسبية',
           'اضافة-تقرير-محاسبي',
           'تعديل-تقرير-محاسبي',
           'حذف-تقرير-محاسبي',
           'طباعة-تقرير-محاسبي',

            'قائمة-التقارير',
           'تقاير-المبيعات',
            'تقاير-المشتريات',
             'تقاير-المخزون',
             'تقاير-النواقص',

              'تقاير-حركات-الخزينة',
               'تقاير-حركات-البنوك',

        'قائمة-موازين-المراجعة',
         'اضافة-ميزان-مراجعة',
          'حذف-ميزان-مراجعة',
         'تعديل-ميزان-مراجعة',

        'قوائم-الدخل',
         'اضافة-قائمة-دخل',
         'حذف-قائمة-دخل',
         'تعديل-قائمة-دخل',

         'ميزان-المراجعة-الموحد',
         'قائمة-المركز-المالي-الموحدة',
         'قائمة-الدخل-الموحدة',

         'الضرائب',
         'مخزون-المنتجات',



        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
